<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
!pip install sqlalchemy==1.3.9

Collecting sqlalchemy==1.3.9
  Downloading SQLAlchemy-1.3.9.tar.gz (6.0 MB)
     ---------------------------------------- 0.0/6.0 MB ? eta -:--:--
     ---------------------------------------- 0.0/6.0 MB ? eta -:--:--
     ---------------------------------------- 0.0/6.0 MB 495.5 kB/s eta 0:00:12
      --------------------------------------- 0.1/6.0 MB 871.5 kB/s eta 0:00:07
     -- ------------------------------------- 0.4/6.0 MB 2.7 MB/s eta 0:00:03
     --- ------------------------------------ 0.5/6.0 MB 2.6 MB/s eta 0:00:03
     ------ --------------------------------- 1.0/6.0 MB 4.2 MB/s eta 0:00:02
     --------- ------------------------------ 1.4/6.0 MB 4.8 MB/s eta 0:00:01
     ----------- ---------------------------- 1.7/6.0 MB 5.3 MB/s eta 0:00:01
     ------------- -------------------------- 2.0/6.0 MB 5.4 MB/s eta 0:00:01
     --------------- ------------------------ 2.3/6.0 MB 5.4 MB/s eta 0:00:01
     ---------------- ----------------------- 2.4/6.0 MB 5.1 MB/s eta 0:00:01
     ------------------ --------------------- 2.7/6.0 MB 5.3 MB/s eta 0:00:01
     -------------------- ------------------- 3.1/6.0 MB 5.5 MB/s eta 0:00:01
     ----------------------- ---------------- 3.5/6.0 MB 5.6 MB/s eta 0:00:01
     -------------------------- ------------- 3.9/6.0 MB 5.9 MB/s eta 0:00:01
     ---------------------------- ----------- 4.2/6.0 MB 5.9 MB/s eta 0:00:01
     ------------------------------ --------- 4.6/6.0 MB 6.0 MB/s eta 0:00:01
     ---------------------------------- ----- 5.1/6.0 MB 6.3 MB/s eta 0:00:01
     ------------------------------------- -- 5.6/6.0 MB 6.5 MB/s eta 0:00:01
     ---------------------------------------  6.0/6.0 MB 6.5 MB/s eta 0:00:01
     ---------------------------------------- 6.0/6.0 MB 6.1 MB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py): started
  Building wheel for sqlalchemy (setup.py): finished with status 'done'
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.9-cp310-cp310-win_amd64.whl size=1142948 sha256=e4e0d4841747d4faa13104831803a9bc13f97fd0e0ac069986c355e53df8a5e1
  Stored in directory: c:\users\vicky\appdata\local\pip\cache\wheels\8b\6d\9c\e1793e5a2d85b89b8c362a4f0e3def54b786bcd14923b9ff00
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [ ]:
%load_ext sql

In [ ]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [ ]:
!pip install -q pandas==1.1.5

In [ ]:
%sql sqlite:///my_data1.db

In [ ]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

**Note:This below code is added to remove blank rows from table**

In [8]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: http://sqlalche.me/e/e3q8)

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [9]:
%sql select Distinct "Launch_Site" from SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [17]:
%sql select * from SPACEXTABLE WHERE "Launch_Site" LIKE "CCA%" LIMIT 5;

 * sqlite:///my_data1.db
Done.

[('2010-04-06', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-08-12', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-08-10', '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-01-03', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [1]:
%sql select SUM("PAYLOAD_MASS__KG_") from SPACEXTABLE WHERE "Customer" LIKE "NASA (CRS)";

UsageError: Line magic function `%sql` not found.

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [23]:
%sql select AVG("PAYLOAD_MASS__KG_") from SPACEXTABLE WHERE "Booster_Version" LIKE "%F9 v1.1%";

 * sqlite:///my_data1.db
Done.

[(2534.6666666666665,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [27]:
%sql select "Date", "Landing_Outcome" from SPACEXTABLE WHERE "Landing_Outcome" == "Success (ground pad)" ORDER BY "DATE" ASC LIMIT 1;

 * sqlite:///my_data1.db
Done.

[('2015-12-22', 'Success (ground pad)')]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [28]:
%sql select "Booster_Version", "PAYLOAD_MASS__KG_", "Landing_Outcome" from SPACEXTABLE WHERE "PAYLOAD_MASS__KG_" > 4000 AND "PAYLOAD_MASS__KG_" < 6000 AND "Landing_Outcome" == "Success (drone ship)";

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022', 4696, 'Success (drone ship)'),
 ('F9 FT B1026', 4600, 'Success (drone ship)'),
 ('F9 FT  B1021.2', 5300, 'Success (drone ship)'),
 ('F9 FT  B1031.2', 5200, 'Success (drone ship)')]

### Task 7




##### List the total number of successful and failure mission outcomes

In [75]:
#%%sql select (select COUNT(*) from SPACEXTABLE WHERE "Mission_Outcome" LIKE "%Success%") AS SUCCESS, 
#(select COUNT(*) from SPACEXTABLE WHERE "Mission_Outcome" LIKE "%Failure%") AS FAILURE from SPACEXTABLE;

In [43]:
%sql select count("Mission_Outcome") AS SUCCESS FROM SPACEXTABLE WHERE "MISSION_OUTCOME" LIKE "%Success%";

 * sqlite:///my_data1.db
Done.

[(100,)]

In [42]:
%sql select count("Mission_Outcome") AS FAILURE FROM SPACEXTABLE WHERE "MISSION_OUTCOME" LIKE "%Failure%";

 * sqlite:///my_data1.db
Done.

[(1,)]

 * sqlite:///my_data1.db
Done.

[(4,)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [53]:
%%sql select "Booster_Version" from SPACEXTABLE
WHERE "PAYLOAD_MASS__KG_" == (select(MAX("PAYLOAD_MASS__KG_") from SPACEXTABLE);

 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "PAYLOAD_MASS__KG_": syntax error
[SQL: select "Booster_Version" from SPACEXTABLE
WHERE "PAYLOAD_MASS__KG_" == "(select(MAX("PAYLOAD_MASS__KG_") from SPACEXTABLE)";]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [63]:
%%sql select Date, substr("Date", 6, 2) AS MONTH, substr("Date", 0, 5) AS YEAR, "Landing_Outcome", "Booster_Version", "Launch_Site" from SPACEXTABLE
WHERE YEAR == "2015" AND "Landing_Outcome" == "Failure (drone ship)";

 * sqlite:///my_data1.db
Done.

[('2015-10-01', '10', '2015', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('2015-04-14', '04', '2015', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [82]:
%%sql select "Landing_Outcome", count(*) AS No from SPACEXTABLE
GROUP BY "Landing_Outcome"
WHERE DATE BETWEEN "2010-06-04" AND "2017-03-20"
ORDER BY No DESC;

 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "WHERE": syntax error
[SQL: select "Landing_Outcome", count(*) AS No from SPACEXTABLE
GROUP BY "Landing_Outcome"
WHERE DATE BETWEEN "2010-06-04" AND "2017-03-20"
ORDER BY No DESC;]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>